---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MaterialAssetParamExternalMaterialId
source: html/80d4fcf9-ada4-3a29-3662-837f9403a358.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MaterialAssetParamExternalMaterialId Property

"External Material ID"

## Syntax (C#)
```csharp
public static ForgeTypeId MaterialAssetParamExternalMaterialId { get; }
```